app/views/posts/show.html.erb

<%if Post.exists?(@post.id+1)%>
	<%post2=Post.find(@post.id+1)%>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]